console.log('number' + 3 + 3);
// відбувається конкатенація, оскільки додається строка
// результатом буде строка: 'number33'

console.log(null + 3);
// null перетворюється на число 0, оскільки додається до числа 3
// результатом буде число: 3

console.log(5 && "qwerty");
// оскільки обидва операнди true, то повертається останнє обчислене значення
// результатом буде строка: 'qwerty'

console.log(+'40' + +'2' + "hillel");
// +'40' перетворюється на число, оскільки стоїть унарний '+' перед строкою
// +'2' перетворюється на число, оскільки стоїть унарний '+' перед строкою
// +'40' + +'2' отримуємо число 42
// 42 + "hillel" відбувається конкатенація, оскільки додається строка
// результатом буде строка: '42hillel'

console.log('10' - 5 === 6);
// '10' перетворюється на число, оскільки віднімається від числа 5
// '10' - 5 буде 5
// 5 === 6 Оператор строгої рівності (===): порівнює два значення на рівність як за значенням, так і за типом даних.
// результатом буде boolean: false

console.log(true + false);
// true перетворюється на число 1, false перетворюється на число 0, Js завжди намагається привести все до числа
// результатом буде число: 1

console.log('4px' - 3);
// оскільки цю строку '4px' не можливо перетворити на число, то буде щось не зрозуміле 
// результатом буде: NaN

console.log('4' - 3);
// строка '4' перетворюється на число, оскільки віднімається від числа 5
// результатом буде число: 1

console.log('6' + 3 ** 0);
// спочатку виконується зведення у ступінь 3 ** 0 буде 1
// потім виконується конкатенація, оскільки додається строка '6' + 1
// результатом буде строка: '61'

console.log(12 / '6')
// строка '6' перетворюється на число, оскільки виконується операція поділу
// результатом буде число: 2

console.log('10' + (5 === 6));
// спочатку виконується операція строгої рівності (5 === 6), оскільки вона в дужках й буде дорівнювати false, оскільки два значення не рівні за значенням, хоча й рівні за типом даних
// потім виконується конкатенація оскільки додається строка '10' + false
// результатом буде строка: '10false'

console.log(null == '');
// виконується операція рівності за значенням між null та пустою строкою, значення не рівні
// результатом буде boolean: false

console.log(3 ** (9 / 3));
// спочатку виконується операція (9 / 3), оскільки вона в дужках й буде дорівнювати 3
// потім виконується зведення у ступінь 3 ** 3
// результатом буде число: 27

console.log(!!'false' == !!'true');
// спочатку виконується інвертація булевих значень, а потім виконується операція рівності за значенням
// !!'false': маємо строку 'false' вона true у boolean значенні, після інвертації !'false' отже вона false й після !!'false' вона true
// !!'true': маємо строку 'true' вона true у boolean значенні, після інвертації !'true' отже вона false й після !!'true' вона true
// отже маємо порівняти два boolean значення: true == true
// результатом буде boolean: true

console.log(0 || '0' && 1);
// спочатку виконується перевірка OR: 0 || '0', яка повертає значення '0' оскільки воно true
// потім виконується перевірка AND: '0' && 1, яка повертає останнє значення 1 оскільки обидва значення true
// результатом буде число: 1

console.log((+null == false) < 1);
// спочатку виконується операція порівняння в дужках (+null == false), оскільки перед null є унарний '+', то значення приводяться до чисел
// тобто (0 == 0) операція порівняння за значенням повертає нам true
// потім виконується наступне порівняння true < 1, true перетворюється на число 1, тобто 1 < 1 не вірне порівняння й буде false
// результатом буде boolean: false

console.log(false && true || true);
// спочатку виконується перевірка AND: false && true, яка повертає значення false, якщо хоча б один з операндів є false
// потім виконується перевірка OR: false || true, яка повертає true, якщо хоча б один з операндів є true
// результатом буде boolean: true

console.log(false && (false || true));
// спочатку виконується перевірка OR в дужках: (false || true), яка повертає true, якщо хоча б один з операндів є true
// потім виконується перевірка AND: false && true, яка повертає значення false, якщо хоча б один з операндів є false
// результатом буде boolean: false

console.log((+null == false) < 1 ** 5);
// спочатку виконується операція порівняння в дужках (+null == false), оскільки перед null є унарний '+', то значення приводяться до чисел
// тобто (0 == 0) операція порівняння за значенням повертає нам true
// потім true приводиться до числа 1, оскільки у нас порівнюються числа
// далі виконується порівняння 1 < 1 ** 5 оскільки 1 ** 5 буде 1, то рівняння не виконається й поверне false
// результатом буде boolean: false